<?php

//Задача №1 - объеденить массивы таким образом, чтобы получить один массив с уникальными ключами,
//заполнив пустые значения, а при совпадении ключей с заполненными значениям - получить многомерный массив
//Выполните задачу 2мя способами - через цикл, и с помощью php функций.

/* //Ожидаемый результат

	Array
	(
		[Материал] => Array
			(
				[0] => Кожа
				[1] => Ткань
			)

		[Вид] => Матрас
		[Тип] => Детские
		[Цвет] => Черный
		[Размер] => Array
			(
				[0] => 200*520
				[1] => 200*420
			)

		[Подсветка] => LED
		[Ножка] => Дерево
	)

*/

$result = array();

$array_1 = array(
    'Материал' => 'Кожа',
    'Вид' => 'Матрас',
    'Тип' => 'Детские',
    'Подсветка' => '',
    'Цвет' => 'Черный',
    'Ножка' => '',
    'Размер' => '200*520'
);

$array_2 = array(
    'Материал' => 'Ткань',
    'Вид' => '',
    'Тип' => '',
    'Подсветка' => 'LED',
    'Цвет' => '',
    'Ножка' => 'Дерево',
    'Размер' => '200*420'
);

$result = combine_arrays_func($array_1, $result);
$result = combine_arrays_func($array_2, $result);

function combine_arrays_func($array_in, $results){

    foreach ($array_in as $key=>$value) {
        if (strlen($value)) {
            if (!isset($results[$key])) {
                $results[$key] = $value;
            } else {
                $results[$key] = array(
                    '0' => $results[$key],
                    '1' => $value
                );
            }
        }
    }

    return $results;
}

echo "<pre>";
var_dump($result);
echo "</pre>";

?>
